[
  {
    "title": "Engineering Scientist",
    "timeframe": "09.2021 - 09.2023",
    "place": "UT Austin | Austin, TX",
    "description": "Working to support complex requirements from many stakeholders, Weber doubled the performance of a mission-critical C++ message passing library. They added compatibility for approximately 10 new types in the SWIG python interface for this product, responding directly to the needs of python developers. This work developed a product that provides real-time GPS data to the department of defense. Weber also had the opportunity to gain valuable DevOps experience. They managed the creation of GitLab continuous integration pipelines that used Docker to automate building, testing, code health report generation, and packaging for two high-priority applications."
  },
  {
    "title": "Research Assistant",
    "timeframe": "01.2020 - 06.2021",
    "place": "UNC Charlotte | Charlotte, NC",
    "description": "Paige Weber worked under Dr. Erik Saule at the High Performance Computing Laboratory. In this position, they managed an individual project to create a custom profiling software using hardware counters (model-specific registers) with the goal of analyzing architecture performance on sparse graph problems. Weber used intel intrinsics, OpenMP, and likwid-perfctr to benchmark desktop systems and compute clusters. While there are many existing software for performance profiling, this project sets itself apart with its ability to automatically visualize CPU architecture within the core, offering unique insight into how code maps to the architecture. This tool has applications both in the education sector as well as on the cutting edge of HPC research. All code written at this position is released under the GNUGPv3 license, available <a href=\"https://github.com/paigeweber13/fine-hardware-visualization\"> here</a>."
  },
  {
    "title": "IT Intern",
    "timeframe": "05.2019 - 08.2019",
    "place": "Sealed Air | Charlotte, NC",
    "description": "Weber participated in an agile full-stack development team tasked with developing and maintaining an Industrial-IoT application used by factories in three countries. In addition to fixing bugs and adding features to this program, they automated the creation of data visualizations used in presentations for company executives. The data they helped present was used to guide decisions at the highest level of this fortune-500 company. While working hard to create value for Sealed Air in just 3 short months, they was able to gain valuable experience with Java, RabbitMQ, Python, R, and ThingWorx."
  },
  {
    "title": "Computer Support Representative",
    "timeframe": "01.2017 - 12.2017",
    "place": "Brigham Young University | Provo, UT",
    "description": "Working in the Center for Teaching and Learning at BYU, Weber juggled many responsibilities while working on a team of only 4 people. They managed the conversion of paper processes to web applications which affected two departments and approximately 110 employees. Due to the small size of the team, they was involved in every step of the development process, from design and management to writing features and fixing bugs. This work tasked her with quickly learning to read and understand a large existing codebase written using the LAMP stack. They also had to simultaneously maintain 50 servers that provided access to over 200 campus websites, provide frontline tech support for three departments, and analyze the needs of employees to recommend what new hardware should be purchased."
  }
]
